{
  "nav": {
    "home": "Home",
    "about": "About",
    "contact": "Contact",
    "sourcesLink": "Sources"
  },
  "common": {
  },
  "buttons": {
    "learnMore": "Learn More"
  },
  "timeline": {
    "title": "LaLiga and Internet Blocking in Spain",
    "subtitle": "A timeline of events and their impact on digital infrastructure",
    "warning": "This is a documented case study. Precedents established may influence future digital policy decisions in the EU. We must not allow this kind of censorship to become widespread.",
    "events": {
      "2024-12-18": {
        "title": "LaLiga Gets Legal Approval to Block Websites",
        "description": "LaLiga received permission from a Barcelona court to ask internet providers (like Movistar, Vodafone, and Orange) to block websites streaming football matches illegally.",
        "impact": "This set the stage for blocking internet addresses (IPs) used by services hosting pirated content."
      },
      "2025-02-09": {
        "title": "LaLiga Begins Blocking Cloudflare IPs",
        "description": "LaLiga began blocking internet addresses tied to Cloudflare, a major infrastructure service that provides CDN and security services to websites.",
        "impact": "The blocks resulted in disruption of thousands of legitimate websites in Spain, including small businesses and government sites.",
        "why": "Cloudflare provides services to more than 240 million websites globally, representing approximately 20% of the world's web infrastructure."
      },
      "2025-02-19": {
        "title": "Cloudflare Fights Back with a Lawsuit",
        "description": "Fed up with the collateral damage, Cloudflare—the company that keeps millions of sites online by shielding them from attacks—and RootedCON, a Spanish cybersecurity collective that advocates for an open internet, sued LaLiga. They argued that blocking whole IP ranges was like shutting down an entire neighbourhood to stop one shoplifter: everyone gets punished.",
        "impact": "The lawsuit highlighted that an IP address is just the numerical \"street address\" of a server. Behind a Content Delivery Network (CDN) like Cloudflare, the same address can be shared by thousands of unrelated sites. Blanket blocks therefore knocked offline innocent stores, blogs, and even government portals."
      },
      "2025-03-26": {
        "title": "Cloudflare Loses Appeal",
        "description": "On 26 March, the same Barcelona judge who had green-lit the December order sided with LaLiga again and tossed out Cloudflare's appeal.",
        "impact": "Spanish users braced for more weekend outages: the sweeping IP blocks would continue during matches."
      },
      "2025-04-12": {
        "title": "Vercel Gets Hit by Blocks",
        "description": "LaLiga now turned its sights on Vercel—a platform developers use to ship code to production in seconds—claiming that some deployments were streaming matches illegally. It demanded that ISPs block entire pools of Vercel IPs. Overnight, personal portfolios, small shops and open-source docs went dark in Spain.",
        "impact": "Thousands of websites hosted on Vercel vanished for Spanish visitors, hampering businesses and developer communities alike.",
        "why": "Vercel powers more than 9 million websites and is beloved by front-end developers."
      },
      "2025-04-15": {
        "title": "Vercel Speaks Out",
        "description": "Guillermo Rauch, Vercel's CEO, broke his silence on X, calling the blocks \"over-aggressive\" and reminding LaLiga that the very people who build the web were being caught in the crossfire.",
        "impact": "His statement piled public pressure onto LaLiga, but the blocks remained while both sides negotiated."
      },
      "2025-05-04": {
        "title": "Twitch and Others Affected",
        "description": "The shockwave spread further. Twitch—the live-streaming service where millions watch esports and chat shows—and hosting service Netlify found their IPs black-listed.",
        "impact": "Gamers, content creators and small businesses alike lost access to their channels and sites for hours."
      },
      "2025-05-20": {
        "title": "Cloudflare's CEO Warns of Dangers",
        "description": "Cloudflare's outspoken CEO, Matthew Prince, vented on X, branding LaLiga's strategy \"bonkers\" and warning that pulling critical IPs could knock out emergency services and even cost lives. He reiterated Cloudflare's offer to help craft laser-focused blocks.",
        "impact": "The post went viral, framing the debate as a matter of public safety rather than football rights."
      },
      "2025-07-06": {
        "title": "Blocks Continue, No Major Resolution",
        "description": "Months later the blocks still stand and no lasting solution is in sight.",
        "impact": "Spanish internet users continue to endure routine outages that cripple millions of legitimate sites."
      }
    }
  },
  "otherPractices": {
    "title": "A History of Controversy",
    "subtitle": "This isn't the first time LaLiga's actions have been questioned. Below are summaries of other notable cases.",
    "cases": [
      {
        "title": "The Spy App",
        "abstract": "In 2018, LaLiga's mobile app was found to be using users' microphones and GPS to spy on bars illegally streaming games. This led to a €250,000 GDPR fine, which was later overturned, but the practice was widely condemned as a breach of privacy.",
        "linkText": "Read the full story"
      },
      {
        "title": "Biometric Surveillance",
        "abstract": "In 2023, LaLiga faced a €1 million fine for implementing facial recognition in stadiums without a proper data protection impact assessment, raising concerns over mass surveillance of fans.",
        "linkText": "Read the full story"
      }
    ]
  },
  "controversiesPage": {
    "title": "A History of Controversies",
    "backLink": "Back to Timeline",
    "cases": [
      {
        "title": "Surveillance through the LaLiga App (2018-2019)",
        "content": "In 2018, LaLiga updated its mobile application, used by millions of users, to include a feature that activated the phone's microphone to detect the unauthorized broadcasting of football matches in public venues like bars and restaurants. This functionality used audio fingerprinting technology to identify match broadcasts and combined it with location data to flag unlicensed venues. In June 2019, the Spanish Agency for Data Protection (AEPD) fined LaLiga €250,000 for infringing the General Data Protection Regulation (GDPR).\n\nThe AEPD determined that LaLiga failed to clearly inform users about the use of their microphones and location data, thereby breaching transparency rules (Article 5.1, GDPR) and the right to withdraw consent (Article 7.3, GDPR). The agency required LaLiga to display a notification, such as an icon, each time the microphone was activated. LaLiga argued that the app only captured a small part of the audio (0.75%) as a digital fingerprint, not conversations, and that users gave their consent during installation. They appealed the fine and deactivated the function on June 30, 2019.",
        "image": "mic",
        "funnyComment": "We're always listening... to your feedback, of course."
      },
      {
        "title": "Biometric Surveillance in Stadiums (2021-Ongoing)",
        "content": "Since 2021, LaLiga has been implementing a biometric access system in football stadiums, which uses facial recognition to verify fans' identities. The system, developed with a technology partner, aims to improve security and streamline entry into venues. Fans who opt-in have their facial data scanned and linked to their ticket information, allowing them to enter the stadium without presenting a physical ticket or ID.\n\nHowever, this initiative has raised significant privacy concerns. Critics argue that the collection and storage of sensitive biometric data create a high-risk database that could be vulnerable to breaches. There are also concerns about function creep—the possibility of this data being used for purposes beyond ticketing, such as surveillance or commercial profiling, without explicit user consent. Data protection authorities and digital rights groups have called for greater transparency on how the data is stored, secured, and for how long it is retained, emphasizing the need to comply with the stringent requirements of GDPR for processing special category data like biometrics.",
        "image": "eye",
        "funnyComment": "Smile! You're on LaLiga's camera."
      }
    ]
  }
} 