{
  "nav": {
    "home": "Inicio",
    "about": "Acerca de",
    "contact": "Contacto",
    "sourcesLink": "Fuentes"
  },
  "common": {
    "welcome": "Bienvenido a nuestro sitio",
    "description": "Este es un sitio multilingüe usando Next.js"
  },
  "buttons": {
    "learnMore": "Saber más"
  },
  "timeline": {
    "title": "LaLiga y los Bloqueos de Internet en España",
    "subtitle": "Una cronología de los eventos y su impacto en la infraestructura digital",
    "warning": "Este es un estudio de caso documentado. Los precedentes legales establecidos pueden influir en futuras decisiones de política digital en la UE.",
    "events": {
      "2024-12-18": {
        "title": "LaLiga Obtiene Aprobación Legal para Bloquear Sitios Web",
        "description": "LaLiga recibió permiso de un tribunal de Barcelona para pedir a los proveedores de internet (como Movistar, Vodafone y Orange) bloquear sitios web que transmiten partidos de fútbol ilegalmente.",
        "impact": "Esto sentó las bases para bloquear direcciones de internet (IPs) utilizadas por servicios que alojan contenido pirata."
      },
      "2025-02-09": {
        "title": "LaLiga Comienza a Bloquear IPs de Cloudflare",
        "description": "LaLiga comenzó a bloquear direcciones de internet vinculadas a Cloudflare, un servicio de infraestructura que proporciona CDN y servicios de seguridad a sitios web.",
        "impact": "Los bloqueos resultaron en la interrupción de miles de sitios web legítimos en España, incluyendo pequeñas empresas y sitios gubernamentales.",
        "why": "Cloudflare proporciona servicios a más de 240 millones de sitios web globalmente, representando aproximadamente el 20% de la infraestructura web mundial."
      },
      "2025-02-19": {
        "title": "Cloudflare Presenta Recurso Legal",
        "description": "Cloudflare y RootedCON presentaron un recurso legal contra LaLiga, cuestionando la proporcionalidad de los bloqueos de IP que afectaron a usuarios y empresas legítimas.",
        "impact": "Argumentaron que los bloqueos eran excesivamente amplios, afectando infraestructura crítica más allá del objetivo específico."
      },
      "2025-03-26": {
        "title": "Cloudflare Pierde la Apelación",
        "description": "Un tribunal (el mismo que aprobó la orden inicial en diciembre de 2024) rechazó la apelación de Cloudflare, permitiendo a LaLiga continuar bloqueando IPs.",
        "impact": "Esto significó que las interrupciones continuarían, especialmente durante los fines de semana de partidos de fútbol."
      },
      "2025-04-12": {
        "title": "Vercel Recibe Notificaciones de Bloqueo",
        "description": "LaLiga envió notificaciones a Vercel, plataforma de hosting y deployment, alegando que alojaba contenido que infringía derechos de autor.",
        "impact": "Los bloqueos dirigidos a las IPs de Vercel interrumpieron sitios web de desarrolladores y empresas que utilizan la plataforma.",
        "why": "Vercel es una plataforma de deployment utilizada por más de 9 millones de sitios web, siendo especialmente popular entre desarrolladores y equipos de desarrollo."
      },
      "2025-04-15": {
        "title": "Vercel Alza la Voz",
        "description": "El CEO de Vercel, Guillermo Rauch, criticó públicamente los bloqueos, explicando que dañaron sitios web y desarrolladores legítimos.",
        "impact": "Vercel reportó estar trabajando con LaLiga para resolver el problema pero notó que los bloqueos eran excesivamente agresivos."
      },
      "2025-05-04": {
        "title": "Twitch y Otros Afectados",
        "description": "Los bloqueos de LaLiga afectaron más plataformas, incluyendo Twitch, un servicio de streaming popular.",
        "impact": "Las IPs de Twitch y otros servicios como Netlify fueron bloqueadas, causando interrupciones para gamers, desarrolladores y empresas."
      },
      "2025-05-20": {
        "title": "El CEO de Cloudflare Advierte de Peligros",
        "description": "El CEO de Cloudflare, Matthew Prince, habló en X, calificando la estrategia de LaLiga como 'disparatada' y advirtiendo que bloquear IPs críticas podría dañar servicios de emergencia e incluso costar vidas.",
        "impact": "Dijo que Cloudflare está dispuesta a ayudar pero quiere soluciones específicas."
      },
      "2025-07-06": {
        "title": "Los Bloqueos Continúan, Sin Resolución Mayor",
        "description": "Hasta la fecha, los bloqueos continúan sin una resolución significativa.",
        "impact": "La internet española sigue siendo interrumpida regularmente, afectando a millones de usuarios legítimos."
      }
    }
  },
  "otherPractices": {
    "title": "Un Historial de Polémicas",
    "subtitle": "No es la primera vez que las acciones de LaLiga son cuestionadas. A continuación se presentan resúmenes de otros casos notables.",
    "cases": [
      {
        "title": "La App Espía",
        "abstract": "En 2018, se descubrió que la aplicación móvil de LaLiga usaba los micrófonos y el GPS de los usuarios para espiar a bares que retransmitían partidos ilegalmente. Esto resultó en una multa de 250.000 € por el RGPD, que luego fue anulada, pero la práctica fue ampliamente condenada como una violación de la privacidad.",
        "linkText": "Leer la historia completa"
      },
      {
        "title": "Vigilancia Biométrica",
        "abstract": "En 2023, LaLiga se enfrentó a una multa de 1 millón de euros por implementar reconocimiento facial en los estadios sin una evaluación de impacto de protección de datos adecuada, lo que generó preocupaciones sobre la vigilancia masiva de los aficionados.",
        "linkText": "Leer la historia completa"
      }
    ]
  },
  "controversiesPage": {
    "title": "Un Historial de Polémicas",
    "backLink": "Volver a la cronología",
    "cases": [
      {
        "title": "Vigilancia a través de la App de LaLiga (2018-2019)",
        "emoji": "🕵️",
        "content": "En 2018, LaLiga actualizó su aplicación móvil, utilizada por millones de usuarios, para incluir una función que activaba el micrófono del teléfono para detectar la retransmisión no autorizada de partidos de fútbol en lugares públicos como bares y restaurantes. Esta funcionalidad utilizaba tecnología de huella digital de audio para identificar las retransmisiones de partidos y la combinaba con datos de ubicación para señalar los locales sin licencia. En junio de 2019, la Agencia Española de Protección de Datos (AEPD) multó a LaLiga con 250.000 € por infringir el Reglamento General de Protección de Datos (RGPD).\n\nLa AEPD determinó que LaLiga no informó claramente a los usuarios sobre el uso de sus micrófonos y datos de ubicación, incumpliendo las normas de transparencia (artículo 5.1, RGPD) y el derecho a retirar el consentimiento (artículo 7.3, RGPD). La agencia exigió a LaLiga que mostrara una notificación, como un icono, cada vez que se activara el micrófono. LaLiga argumentó que la app solo capturaba una pequeña parte del audio (0,75%) como huella digital, no conversaciones, y que los usuarios daban su consentimiento durante la instalación. Apelaron la multa y desactivaron la función el 30 de junio de 2019.",
        "image": "mic",
        "funnyComment": "[Insertar comentario gracioso que no se me ha ocurrido aún]"
      },
      {
        "title": "Uso de datos biométricos en estadios sin evaluación de impacto (2023–2025)",
        "emoji": "🏟️",
        "content": "A partir de 2023, LaLiga introdujo sistemas de reconocimiento facial en algunos estadios para controlar el acceso y hacer frente a la violencia, el racismo y la intolerancia, según lo dispuesto por la Comisión Antiviolencia y el Consejo Superior de Deportes (CSD) de España. En marzo de 2025, la AEPD multó a LaLiga con 1 millón de euros por no realizar una Evaluación de Impacto relativa a la Protección de Datos (EIPD) antes de utilizar datos biométricos, incumpliendo los requisitos del RGPD.\n\nLa AEPD declaró que LaLiga, como responsable del tratamiento, no evaluó los riesgos para la privacidad de los espectadores. La multa incluía la orden de suspender el tratamiento de datos biométricos hasta que se completara una EIPD. LaLiga recurrió, argumentando que los clubes, y no LaLiga, gestionaban los datos biométricos y que los sistemas eran requeridos por el CSD y la Comisión Antiviolencia.\n\nHicieron referencia a la sentencia del Tribunal Supremo de 2024 a su favor en el caso de la app para impugnar la decisión de la AEPD. Esta controversia plantea preocupaciones sobre la privacidad en los espacios públicos, ya que la recopilación de datos biométricos afecta a todos los asistentes al estadio.",
        "image": "eye",
        "funnyComment": "¡Sonríe! Estás en la cámara de LaLiga."
      }
    ]
  }
} 